In [38]:
import pandas as pd
from sqlalchemy import create_engine
import datetime

In [4]:
engine = create_engine("postgresql://avnadmin:aiven cloud link aivencloud.com:port/defaultdb")

In [ ]:
query=select*from health.bmi

In [8]:
df=pd.read_sql("select*from health.bmi",engine)

In [9]:
df.head()

  Gender     Height      Weight  Born_Year
0   Male  73.847017  241.893563     1967.0
1   Male  68.781904  162.310473     1977.0
2   Male  74.110105  212.740856     1991.0
3   Male  71.730978  220.042470     1998.0
4   Male  69.881796  206.349801     1985.0

In [12]:
df.tail()

      Gender     Height      Weight  Born_Year
9995  Female  66.172652  136.777454     2003.0
9996  Female  67.067155  170.867906        NaN
9997  Female  63.867992  128.475319     2002.0
9998  Female  69.034243  163.852461     1983.0
9999  Female  61.944246  113.649103     1986.0

In [15]:
df.shape #to check for number of rows

(10000, 4)

In [14]:
df.isnull().sum() #checking number of nulls

Gender          0
Height          0
Weight          0
Born_Year    1000
dtype: int64

In [29]:
#droping null values
#df.dropna()
#df.dropna(axis=1)

      Gender     Height      Weight  Born_Year
0       Male  73.847017  241.893563     1967.0
1       Male  68.781904  162.310473     1977.0
2       Male  74.110105  212.740856     1991.0
3       Male  71.730978  220.042470     1998.0
4       Male  69.881796  206.349801     1985.0
...      ...        ...         ...        ...
9995  Female  66.172652  136.777454     2003.0
9996  Female  67.067155  170.867906     1980.0
9997  Female  63.867992  128.475319     2002.0
9998  Female  69.034243  163.852461     1983.0
9999  Female  61.944246  113.649103     1986.0

[10000 rows x 4 columns]

In [37]:
df['BMI'] = (df['Weight'] / df['Height']**2)*703.
df.head()

  Gender     Height      Weight  Born_Year        BMI
0   Male  73.847017  241.893563       1967  31.182700
1   Male  68.781904  162.310473       1977  24.118677
2   Male  74.110105  212.740856       1991  27.230233
3   Male  71.730978  220.042470       1998  30.064108
4   Male  69.881796  206.349801       1985  29.705117

In [41]:
df['current_year'] =datetime.datetime.now().year
df.head()

  Gender     Height      Weight  Born_Year        BMI  current_year
0   Male  73.847017  241.893563       1967  31.182700          2025
1   Male  68.781904  162.310473       1977  24.118677          2025
2   Male  74.110105  212.740856       1991  27.230233          2025
3   Male  71.730978  220.042470       1998  30.064108          2025
4   Male  69.881796  206.349801       1985  29.705117          2025

In [43]:
df['age']=(df['current_year'] - df['Born_Year'])
df.head()

  Gender     Height      Weight  Born_Year        BMI  current_year  age
0   Male  73.847017  241.893563       1967  31.182700          2025   58
1   Male  68.781904  162.310473       1977  24.118677          2025   48
2   Male  74.110105  212.740856       1991  27.230233          2025   34
3   Male  71.730978  220.042470       1998  30.064108          2025   27
4   Male  69.881796  206.349801       1985  29.705117          2025   40

Underweight - BMI under 18.5 kg/m^2.

Normal weight - BMI greater than or equal to 18.5 to 24.9 kg/m^2.

Overweight â€“ BMI greater than or equal to 25 to 29.9 kg/m^2.

Obesity â€“ BMI greater than or equal to 30 kg/m^2.

Obesity class I â€“ BMI 30 to 34.9 kg/m^2.

In [50]:
def bmi_category(bmi):
  if bmi<18.5:
    return'underweight'
  elif bmi<=24.5:
    return 'normal weight'
  elif bmi<=29.5:
    return 'overweight'
  elif bmi>=30:
    return 'obesity'
  else :
    return 'obese class I'

In [51]:
bmi_category(18.5)

'normal weight'

In [57]:
df['bmi_category']= df['BMI'].apply(bmi_category)

In [58]:
df.head()

,Gender,Height,Weight,Born_Year,BMI,current_year,age,bmi_category
0,Male,73.847017,241.893563,1967,31.182700,2025,58,obesity
1,Male,68.781904,162.310473,1977,24.118677,2025,48,normal weight
2,Male,74.110105,212.740856,1991,27.230233,2025,34,overweight
3,Male,71.730978,220.042470,1998,30.064108,2025,27,obesity
4,Male,69.881796,206.349801,1985,29.705117,2025,40,obese class I

df.head()

In [31]:
df['Born_Year']=df['Born_Year'].astype(int) #changing datatypes from float to int
df.dtypes

Gender        object
Height       float64
Weight       float64
Born_Year      int64
dtype: object

(weight in pounds/height in inches^2)*703

In [32]:
df.head()

  Gender     Height      Weight  Born_Year
0   Male  73.847017  241.893563       1967
1   Male  68.781904  162.310473       1977
2   Male  74.110105  212.740856       1991
3   Male  71.730978  220.042470       1998
4   Male  69.881796  206.349801       1985

In [17]:
df.dtypes #check for data types

Gender        object
Height       float64
Weight       float64
Born_Year    float64
dtype: object

In [18]:
df.describe()

             Height        Weight    Born_Year
count  10000.000000  10000.000000  9000.000000
mean      66.367560    161.440357  1985.366556
std        3.847528     32.108439    11.441963
min       54.263133     64.700127  1966.000000
25%       63.505620    135.818051  1976.000000
50%       66.318070    161.212928  1985.000000
75%       69.174262    187.169525  1995.000000
max       78.998742    269.989699  2005.000000

In [24]:
cv =(32.11/161.44)*100 #checks percentage cooefficient of varaiance to determine whether to use mode or mean
cv

19.889742319127848

In [ ]:
cv =(11.)

In [22]:
df['Born_Year'] = df['Born_Year'].fillna(df['Born_Year'].mode()[0])

In [ ]:
df.isnull().sum

In [16]:
df.to_sql('bmi',engine, if_exists='replace',index=False ,schema ='your schema name')

1000